#include "Buzzer.h"

bit Buzz_flag = 0;
/*========================================================================*/
/*函数名称:void BuzzerControl()
/*函数功能:蜂鸣器控制
/*输入参数:无
/*输出参数:无
/*========================================================================*/
void BuzzerControl()
{
	if(Buzz_flag == 1)
	{
		Buzz = 1;
		Delay100us();
		Buzz = 0;
	}
	else if(Buzz_flag == 0)
	{
		Buzz = 1;
	}
}

/*========================================================================*/
/*函数名称:void Delay_100us()
/*函数功能:延时100us
/*输入参数:无
/*输出参数:无
/*========================================================================*/
void Delay100us()		//@12.000MHz
{
	unsigned char i, j;

	i = 2;
	j = 39;
	do
	{
		while (--j);
	} while (--i);
}
/*========================================================================*/
/*函数名称:void Delay100ms()
/*函数功能:延时100ms
/*输入参数:无
/*输出参数:无
/*========================================================================*/
void Delay100ms()		//@20.000MHz
{
	unsigned char i, j, k;

	_nop_();
	_nop_();
	i = 8;
	j = 154;
	k = 122;
	do
	{
		do
		{
			while (--k);
		} while (--j);
	} while (--i);
}
